fabiangv29/Esp8266/boards.txt
#
# Do not create pull-requests for this file only, CI will not accept them.
# You *must* edit/modify/run boards.txt.py to regenerate boards.txt.
# All modified files after running with option "--allgen" must be included in the pull-request.
#

menu.BoardModel=Model
menu.ESPModule=Module
menu.UploadTool=Upload Tool
menu.led=Builtin Led
menu.baud=Upload Speed
menu.xtal=CPU Frequency
menu.CrystalFreq=Crystal Frequency
menu.eesz=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.ResetMethod=Reset Method
menu.dbg=Debug port
menu.lvl=Debug Level
menu.ip=lwIP Variant
menu.vt=VTables
menu.exception=C++ Exceptions
menu.stacksmash=Stack Protection
menu.wipe=Erase Flash
menu.sdk=NONOS SDK Version
menu.ssl=SSL Support
menu.mmu=MMU
menu.non32xfer=Non-32-Bit Access

##############################################################
moes_t1_3.name=Moes T1 3
moes_t1_3.build.board=Moes_T1_3
moes_t1_3.build.variant=moes_T1_3
moes_t1_3.upload.tool=esptool
moes_t1_3.upload.maximum_data_size=81920
moes_t1_3.upload.wait_for_upload_port=true
moes_t1_3.upload.erase_cmd=
moes_t1_3.serial.disableDTR=true
moes_t1_3.serial.disableRTS=true
moes_t1_3.build.mcu=esp8266
moes_t1_3.build.core=esp8266
moes_t1_3.build.spiffs_pagesize=256
moes_t1_3.build.debug_port=
moes_t1_3.build.debug_level=
moes_t1_3.menu.xtal.80=80 MHz
moes_t1_3.menu.xtal.80.build.f_cpu=80000000L
moes_t1_3.menu.xtal.160=160 MHz
moes_t1_3.menu.xtal.160.build.f_cpu=160000000L
moes_t1_3.menu.vt.flash=Flash
moes_t1_3.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
moes_t1_3.menu.vt.heap=Heap
moes_t1_3.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
moes_t1_3.menu.vt.iram=IRAM
moes_t1_3.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
moes_t1_3.menu.exception.disabled=Disabled (new aborts on oom)
moes_t1_3.menu.exception.disabled.build.exception_flags=-fno-exceptions
moes_t1_3.menu.exception.disabled.build.stdcpp_lib=-lstdc++
moes_t1_3.menu.exception.enabled=Enabled
moes_t1_3.menu.exception.enabled.build.exception_flags=-fexceptions
moes_t1_3.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
moes_t1_3.menu.stacksmash.disabled=Disabled
moes_t1_3.menu.stacksmash.disabled.build.stacksmash_flags=
moes_t1_3.menu.stacksmash.enabled=Enabled
moes_t1_3.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
moes_t1_3.menu.ssl.all=All SSL ciphers (most compatible)
moes_t1_3.menu.ssl.all.build.sslflags=
moes_t1_3.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
moes_t1_3.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
moes_t1_3.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
moes_t1_3.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
moes_t1_3.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
moes_t1_3.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
moes_t1_3.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
moes_t1_3.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
moes_t1_3.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
moes_t1_3.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
moes_t1_3.menu.mmu.ext128k=128K Heap External 23LC1024
moes_t1_3.menu.mmu.ext128k.build.mmuflags=-DMMU_EXTERNAL_HEAP=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
moes_t1_3.menu.mmu.ext8192k=8M w/256K Heap External 64 MBit PSRAM
moes_t1_3.menu.mmu.ext8192k.build.mmuflags=-DMMU_EXTERNAL_HEAP=256 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
moes_t1_3.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
moes_t1_3.menu.non32xfer.fast.build.non32xferflags=
moes_t1_3.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
moes_t1_3.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
moes_t1_3.menu.ResetMethod.nodemcu=dtr (aka nodemcu)
moes_t1_3.menu.ResetMethod.nodemcu.upload.resetmethod=--before default_reset --after hard_reset
moes_t1_3.menu.ResetMethod.ck=no dtr (aka ck)
moes_t1_3.menu.ResetMethod.ck.upload.resetmethod=--before no_reset --after soft_reset
moes_t1_3.menu.ResetMethod.nodtr_nosync=no dtr, no_sync
moes_t1_3.menu.ResetMethod.nodtr_nosync.upload.resetmethod=--before no_reset_no_sync --after soft_reset
moes_t1_3.menu.CrystalFreq.26=26 MHz
moes_t1_3.menu.CrystalFreq.40=40 MHz
moes_t1_3.menu.CrystalFreq.40.build.extra_flags=-DF_CRYSTAL=40000000
moes_t1_3.menu.FlashFreq.40=40MHz
moes_t1_3.menu.FlashFreq.40.build.flash_freq=40
moes_t1_3.menu.FlashFreq.80=80MHz
moes_t1_3.menu.FlashFreq.80.build.flash_freq=80
moes_t1_3.menu.FlashFreq.20=20MHz
moes_t1_3.menu.FlashFreq.20.build.flash_freq=20
moes_t1_3.menu.FlashFreq.26=26MHz
moes_t1_3.menu.FlashFreq.26.build.flash_freq=26
moes_t1_3.menu.FlashMode.dout=DOUT (compatible)
moes_t1_3.menu.FlashMode.dout.build.flash_mode=dout
moes_t1_3.menu.FlashMode.dout.build.flash_flags=-DFLASHMODE_DOUT
moes_t1_3.menu.FlashMode.dio=DIO
moes_t1_3.menu.FlashMode.dio.build.flash_mode=dio
moes_t1_3.menu.FlashMode.dio.build.flash_flags=-DFLASHMODE_DIO
moes_t1_3.menu.FlashMode.qout=QOUT
moes_t1_3.menu.FlashMode.qout.build.flash_mode=qout
moes_t1_3.menu.FlashMode.qout.build.flash_flags=-DFLASHMODE_QOUT
moes_t1_3.menu.FlashMode.qio=QIO (fast)
moes_t1_3.menu.FlashMode.qio.build.flash_mode=qio
moes_t1_3.menu.FlashMode.qio.build.flash_flags=-DFLASHMODE_QIO
moes_t1_3.menu.eesz.1M64=1MB (FS:64KB OTA:~470KB)
moes_t1_3.menu.eesz.1M64.build.flash_size=1M
moes_t1_3.menu.eesz.1M64.build.flash_ld=eagle.flash.1m64.ld
moes_t1_3.menu.eesz.1M64.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.1M64.build.rfcal_addr=0xFC000
moes_t1_3.menu.eesz.1M64.build.spiffs_start=0xEB000
moes_t1_3.menu.eesz.1M64.build.spiffs_end=0xFB000
moes_t1_3.menu.eesz.1M64.build.spiffs_blocksize=4096
moes_t1_3.menu.eesz.1M128=1MB (FS:128KB OTA:~438KB)
moes_t1_3.menu.eesz.1M128.build.flash_size=1M
moes_t1_3.menu.eesz.1M128.build.flash_ld=eagle.flash.1m128.ld
moes_t1_3.menu.eesz.1M128.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.1M128.build.rfcal_addr=0xFC000
moes_t1_3.menu.eesz.1M128.build.spiffs_start=0xDB000
moes_t1_3.menu.eesz.1M128.build.spiffs_end=0xFB000
moes_t1_3.menu.eesz.1M128.build.spiffs_blocksize=4096
moes_t1_3.menu.eesz.1M144=1MB (FS:144KB OTA:~430KB)
moes_t1_3.menu.eesz.1M144.build.flash_size=1M
moes_t1_3.menu.eesz.1M144.build.flash_ld=eagle.flash.1m144.ld
moes_t1_3.menu.eesz.1M144.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.1M144.build.rfcal_addr=0xFC000
moes_t1_3.menu.eesz.1M144.build.spiffs_start=0xD7000
moes_t1_3.menu.eesz.1M144.build.spiffs_end=0xFB000
moes_t1_3.menu.eesz.1M144.build.spiffs_blocksize=4096
moes_t1_3.menu.eesz.1M160=1MB (FS:160KB OTA:~422KB)
moes_t1_3.menu.eesz.1M160.build.flash_size=1M
moes_t1_3.menu.eesz.1M160.build.flash_ld=eagle.flash.1m160.ld
moes_t1_3.menu.eesz.1M160.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.1M160.build.rfcal_addr=0xFC000
moes_t1_3.menu.eesz.1M160.build.spiffs_start=0xD3000
moes_t1_3.menu.eesz.1M160.build.spiffs_end=0xFB000
moes_t1_3.menu.eesz.1M160.build.spiffs_blocksize=4096
moes_t1_3.menu.eesz.1M192=1MB (FS:192KB OTA:~406KB)
moes_t1_3.menu.eesz.1M192.build.flash_size=1M
moes_t1_3.menu.eesz.1M192.build.flash_ld=eagle.flash.1m192.ld
moes_t1_3.menu.eesz.1M192.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.1M192.build.rfcal_addr=0xFC000
moes_t1_3.menu.eesz.1M192.build.spiffs_start=0xCB000
moes_t1_3.menu.eesz.1M192.build.spiffs_end=0xFB000
moes_t1_3.menu.eesz.1M192.build.spiffs_blocksize=4096
moes_t1_3.menu.eesz.1M256=1MB (FS:256KB OTA:~374KB)
moes_t1_3.menu.eesz.1M256.build.flash_size=1M
moes_t1_3.menu.eesz.1M256.build.flash_ld=eagle.flash.1m256.ld
moes_t1_3.menu.eesz.1M256.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.1M256.build.rfcal_addr=0xFC000
moes_t1_3.menu.eesz.1M256.build.spiffs_start=0xBB000
moes_t1_3.menu.eesz.1M256.build.spiffs_end=0xFB000
moes_t1_3.menu.eesz.1M256.build.spiffs_blocksize=4096
moes_t1_3.menu.eesz.1M512=1MB (FS:512KB OTA:~246KB)
moes_t1_3.menu.eesz.1M512.build.flash_size=1M
moes_t1_3.menu.eesz.1M512.build.flash_ld=eagle.flash.1m512.ld
moes_t1_3.menu.eesz.1M512.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.1M512.build.rfcal_addr=0xFC000
moes_t1_3.menu.eesz.1M512.build.spiffs_start=0x7B000
moes_t1_3.menu.eesz.1M512.build.spiffs_end=0xFB000
moes_t1_3.menu.eesz.1M512.build.spiffs_blocksize=8192
moes_t1_3.menu.eesz.1M=1MB (FS:none OTA:~502KB)
moes_t1_3.menu.eesz.1M.build.flash_size=1M
moes_t1_3.menu.eesz.1M.build.flash_ld=eagle.flash.1m.ld
moes_t1_3.menu.eesz.1M.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.1M.build.rfcal_addr=0xFC000
moes_t1_3.menu.eesz.2M64=2MB (FS:64KB OTA:~992KB)
moes_t1_3.menu.eesz.2M64.build.flash_size=2M
moes_t1_3.menu.eesz.2M64.build.flash_ld=eagle.flash.2m64.ld
moes_t1_3.menu.eesz.2M64.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.2M64.build.rfcal_addr=0x1FC000
moes_t1_3.menu.eesz.2M64.build.spiffs_start=0x1F0000
moes_t1_3.menu.eesz.2M64.build.spiffs_end=0x1FB000
moes_t1_3.menu.eesz.2M64.build.spiffs_blocksize=4096
moes_t1_3.menu.eesz.2M128=2MB (FS:128KB OTA:~960KB)
moes_t1_3.menu.eesz.2M128.build.flash_size=2M
moes_t1_3.menu.eesz.2M128.build.flash_ld=eagle.flash.2m128.ld
moes_t1_3.menu.eesz.2M128.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.2M128.build.rfcal_addr=0x1FC000
moes_t1_3.menu.eesz.2M128.build.spiffs_start=0x1E0000
moes_t1_3.menu.eesz.2M128.build.spiffs_end=0x1FB000
moes_t1_3.menu.eesz.2M128.build.spiffs_blocksize=4096
moes_t1_3.menu.eesz.2M256=2MB (FS:256KB OTA:~896KB)
moes_t1_3.menu.eesz.2M256.build.flash_size=2M
moes_t1_3.menu.eesz.2M256.build.flash_ld=eagle.flash.2m256.ld
moes_t1_3.menu.eesz.2M256.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.2M256.build.rfcal_addr=0x1FC000
moes_t1_3.menu.eesz.2M256.build.spiffs_start=0x1C0000
moes_t1_3.menu.eesz.2M256.build.spiffs_end=0x1FB000
moes_t1_3.menu.eesz.2M256.build.spiffs_blocksize=4096
moes_t1_3.menu.eesz.2M512=2MB (FS:512KB OTA:~768KB)
moes_t1_3.menu.eesz.2M512.build.flash_size=2M
moes_t1_3.menu.eesz.2M512.build.flash_ld=eagle.flash.2m512.ld
moes_t1_3.menu.eesz.2M512.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.2M512.build.rfcal_addr=0x1FC000
moes_t1_3.menu.eesz.2M512.build.spiffs_start=0x180000
moes_t1_3.menu.eesz.2M512.build.spiffs_end=0x1FA000
moes_t1_3.menu.eesz.2M512.build.spiffs_blocksize=8192
moes_t1_3.menu.eesz.2M1M=2MB (FS:1MB OTA:~512KB)
moes_t1_3.menu.eesz.2M1M.build.flash_size=2M
moes_t1_3.menu.eesz.2M1M.build.flash_ld=eagle.flash.2m1m.ld
moes_t1_3.menu.eesz.2M1M.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.2M1M.build.rfcal_addr=0x1FC000
moes_t1_3.menu.eesz.2M1M.build.spiffs_start=0x100000
moes_t1_3.menu.eesz.2M1M.build.spiffs_end=0x1FA000
moes_t1_3.menu.eesz.2M1M.build.spiffs_blocksize=8192
moes_t1_3.menu.eesz.2M=2MB (FS:none OTA:~1019KB)
moes_t1_3.menu.eesz.2M.build.flash_size=2M
moes_t1_3.menu.eesz.2M.build.flash_ld=eagle.flash.2m.ld
moes_t1_3.menu.eesz.2M.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.2M.build.rfcal_addr=0x1FC000
moes_t1_3.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
moes_t1_3.menu.eesz.4M2M.build.flash_size=4M
moes_t1_3.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
moes_t1_3.menu.eesz.4M2M.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
moes_t1_3.menu.eesz.4M2M.build.spiffs_start=0x200000
moes_t1_3.menu.eesz.4M2M.build.spiffs_end=0x3FA000
moes_t1_3.menu.eesz.4M2M.build.spiffs_blocksize=8192
moes_t1_3.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
moes_t1_3.menu.eesz.4M3M.build.flash_size=4M
moes_t1_3.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
moes_t1_3.menu.eesz.4M3M.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
moes_t1_3.menu.eesz.4M3M.build.spiffs_start=0x100000
moes_t1_3.menu.eesz.4M3M.build.spiffs_end=0x3FA000
moes_t1_3.menu.eesz.4M3M.build.spiffs_blocksize=8192
moes_t1_3.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
moes_t1_3.menu.eesz.4M1M.build.flash_size=4M
moes_t1_3.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
moes_t1_3.menu.eesz.4M1M.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
moes_t1_3.menu.eesz.4M1M.build.spiffs_start=0x300000
moes_t1_3.menu.eesz.4M1M.build.spiffs_end=0x3FA000
moes_t1_3.menu.eesz.4M1M.build.spiffs_blocksize=8192
moes_t1_3.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
moes_t1_3.menu.eesz.4M.build.flash_size=4M
moes_t1_3.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
moes_t1_3.menu.eesz.4M.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.4M.build.rfcal_addr=0x3FC000
moes_t1_3.menu.eesz.8M6M=8MB (FS:6MB OTA:~1019KB)
moes_t1_3.menu.eesz.8M6M.build.flash_size=8M
moes_t1_3.menu.eesz.8M6M.build.flash_ld=eagle.flash.8m6m.ld
moes_t1_3.menu.eesz.8M6M.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.8M6M.build.rfcal_addr=0x7FC000
moes_t1_3.menu.eesz.8M6M.build.spiffs_start=0x200000
moes_t1_3.menu.eesz.8M6M.build.spiffs_end=0x7FA000
moes_t1_3.menu.eesz.8M6M.build.spiffs_blocksize=8192
moes_t1_3.menu.eesz.8M7M=8MB (FS:7MB OTA:~512KB)
moes_t1_3.menu.eesz.8M7M.build.flash_size=8M
moes_t1_3.menu.eesz.8M7M.build.flash_ld=eagle.flash.8m7m.ld
moes_t1_3.menu.eesz.8M7M.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.8M7M.build.rfcal_addr=0x7FC000
moes_t1_3.menu.eesz.8M7M.build.spiffs_start=0x100000
moes_t1_3.menu.eesz.8M7M.build.spiffs_end=0x7FA000
moes_t1_3.menu.eesz.8M7M.build.spiffs_blocksize=8192
moes_t1_3.menu.eesz.8M=8MB (FS:none OTA:~1019KB)
moes_t1_3.menu.eesz.8M.build.flash_size=8M
moes_t1_3.menu.eesz.8M.build.flash_ld=eagle.flash.8m.ld
moes_t1_3.menu.eesz.8M.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.8M.build.rfcal_addr=0x7FC000
moes_t1_3.menu.eesz.16M14M=16MB (FS:14MB OTA:~1019KB)
moes_t1_3.menu.eesz.16M14M.build.flash_size=16M
moes_t1_3.menu.eesz.16M14M.build.flash_ld=eagle.flash.16m14m.ld
moes_t1_3.menu.eesz.16M14M.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.16M14M.build.rfcal_addr=0xFFC000
moes_t1_3.menu.eesz.16M14M.build.spiffs_start=0x200000
moes_t1_3.menu.eesz.16M14M.build.spiffs_end=0xFFA000
moes_t1_3.menu.eesz.16M14M.build.spiffs_blocksize=8192
moes_t1_3.menu.eesz.16M15M=16MB (FS:15MB OTA:~512KB)
moes_t1_3.menu.eesz.16M15M.build.flash_size=16M
moes_t1_3.menu.eesz.16M15M.build.flash_ld=eagle.flash.16m15m.ld
moes_t1_3.menu.eesz.16M15M.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.16M15M.build.rfcal_addr=0xFFC000
moes_t1_3.menu.eesz.16M15M.build.spiffs_start=0x100000
moes_t1_3.menu.eesz.16M15M.build.spiffs_end=0xFFA000
moes_t1_3.menu.eesz.16M15M.build.spiffs_blocksize=8192
moes_t1_3.menu.eesz.16M=16MB (FS:none OTA:~1019KB)
moes_t1_3.menu.eesz.16M.build.flash_size=16M
moes_t1_3.menu.eesz.16M.build.flash_ld=eagle.flash.16m.ld
moes_t1_3.menu.eesz.16M.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.16M.build.rfcal_addr=0xFFC000
moes_t1_3.menu.eesz.512K32=512KB (FS:32KB OTA:~230KB)
moes_t1_3.menu.eesz.512K32.build.flash_size=512K
moes_t1_3.menu.eesz.512K32.build.flash_ld=eagle.flash.512k32.ld
moes_t1_3.menu.eesz.512K32.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.512K32.build.rfcal_addr=0x7C000
moes_t1_3.menu.eesz.512K32.build.spiffs_start=0x73000
moes_t1_3.menu.eesz.512K32.build.spiffs_end=0x7B000
moes_t1_3.menu.eesz.512K32.build.spiffs_blocksize=4096
moes_t1_3.menu.eesz.512K64=512KB (FS:64KB OTA:~214KB)
moes_t1_3.menu.eesz.512K64.build.flash_size=512K
moes_t1_3.menu.eesz.512K64.build.flash_ld=eagle.flash.512k64.ld
moes_t1_3.menu.eesz.512K64.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.512K64.build.rfcal_addr=0x7C000
moes_t1_3.menu.eesz.512K64.build.spiffs_start=0x6B000
moes_t1_3.menu.eesz.512K64.build.spiffs_end=0x7B000
moes_t1_3.menu.eesz.512K64.build.spiffs_blocksize=4096
moes_t1_3.menu.eesz.512K128=512KB (FS:128KB OTA:~182KB)
moes_t1_3.menu.eesz.512K128.build.flash_size=512K
moes_t1_3.menu.eesz.512K128.build.flash_ld=eagle.flash.512k128.ld
moes_t1_3.menu.eesz.512K128.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.512K128.build.rfcal_addr=0x7C000
moes_t1_3.menu.eesz.512K128.build.spiffs_start=0x5B000
moes_t1_3.menu.eesz.512K128.build.spiffs_end=0x7B000
moes_t1_3.menu.eesz.512K128.build.spiffs_blocksize=4096
moes_t1_3.menu.eesz.512K=512KB (FS:none OTA:~246KB)
moes_t1_3.menu.eesz.512K.build.flash_size=512K
moes_t1_3.menu.eesz.512K.build.flash_ld=eagle.flash.512k.ld
moes_t1_3.menu.eesz.512K.build.spiffs_pagesize=256
moes_t1_3.menu.eesz.512K.build.rfcal_addr=0x7C000
moes_t1_3.menu.sdk.nonosdk_190703=nonos-sdk 2.2.1+100 (190703)
moes_t1_3.menu.sdk.nonosdk_190703.build.sdk=NONOSDK22x_190703
moes_t1_3.menu.sdk.nonosdk_191122=nonos-sdk 2.2.1+119 (191122)
moes_t1_3.menu.sdk.nonosdk_191122.build.sdk=NONOSDK22x_191122
moes_t1_3.menu.sdk.nonosdk_191105=nonos-sdk 2.2.1+113 (191105)
moes_t1_3.menu.sdk.nonosdk_191105.build.sdk=NONOSDK22x_191105
moes_t1_3.menu.sdk.nonosdk_191024=nonos-sdk 2.2.1+111 (191024)
moes_t1_3.menu.sdk.nonosdk_191024.build.sdk=NONOSDK22x_191024
moes_t1_3.menu.sdk.nonosdk_190313=nonos-sdk 2.2.1+61 (190313)
moes_t1_3.menu.sdk.nonosdk_190313.build.sdk=NONOSDK22x_190313
moes_t1_3.menu.sdk.nonosdk221=nonos-sdk 2.2.1 (legacy)
moes_t1_3.menu.sdk.nonosdk221.build.sdk=NONOSDK221
moes_t1_3.menu.sdk.nonosdk305=nonos-sdk 3.0.5 (experimental)
moes_t1_3.menu.sdk.nonosdk305.build.sdk=NONOSDK305
moes_t1_3.menu.ip.lm2f=v2 Lower Memory
moes_t1_3.menu.ip.lm2f.build.lwip_include=lwip2/include
moes_t1_3.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
moes_t1_3.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
moes_t1_3.menu.ip.hb2f=v2 Higher Bandwidth
moes_t1_3.menu.ip.hb2f.build.lwip_include=lwip2/include
moes_t1_3.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
moes_t1_3.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
moes_t1_3.menu.ip.lm2n=v2 Lower Memory (no features)
moes_t1_3.menu.ip.lm2n.build.lwip_include=lwip2/include
moes_t1_3.menu.ip.lm2n.build.lwip_lib=-llwip2-536
moes_t1_3.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
moes_t1_3.menu.ip.hb2n=v2 Higher Bandwidth (no features)
moes_t1_3.menu.ip.hb2n.build.lwip_include=lwip2/include
moes_t1_3.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
moes_t1_3.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
