fabiangv29/Esp8266/boards.txt
##############################################################
test_nodemcu.name=Test NodeMCU
test_nodemcu.build.board=Test_NodeMCU
test_nodemcu.build.variant=test_nodemcu
test_nodemcu.upload.tool=esptool
test_nodemcu.upload.maximum_data_size=81920
test_nodemcu.upload.wait_for_upload_port=true
test_nodemcu.upload.erase_cmd=
test_nodemcu.serial.disableDTR=true
test_nodemcu.serial.disableRTS=true
test_nodemcu.build.mcu=esp8266
test_nodemcu.build.core=esp8266
test_nodemcu.build.spiffs_pagesize=256
test_nodemcu.build.debug_port=
test_nodemcu.build.debug_level=
test_nodemcu.menu.xtal.80=80 MHz
test_nodemcu.menu.xtal.80.build.f_cpu=80000000L
test_nodemcu.menu.xtal.160=160 MHz
test_nodemcu.menu.xtal.160.build.f_cpu=160000000L
test_nodemcu.menu.vt.flash=Flash
test_nodemcu.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
test_nodemcu.menu.vt.heap=Heap
test_nodemcu.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
test_nodemcu.menu.vt.iram=IRAM
test_nodemcu.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
test_nodemcu.menu.exception.disabled=Disabled (new aborts on oom)
test_nodemcu.menu.exception.disabled.build.exception_flags=-fno-exceptions
test_nodemcu.menu.exception.disabled.build.stdcpp_lib=-lstdc++
test_nodemcu.menu.exception.enabled=Enabled
test_nodemcu.menu.exception.enabled.build.exception_flags=-fexceptions
test_nodemcu.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
test_nodemcu.menu.stacksmash.disabled=Disabled
test_nodemcu.menu.stacksmash.disabled.build.stacksmash_flags=
test_nodemcu.menu.stacksmash.enabled=Enabled
test_nodemcu.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
test_nodemcu.menu.ssl.all=All SSL ciphers (most compatible)
test_nodemcu.menu.ssl.all.build.sslflags=
test_nodemcu.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
test_nodemcu.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
test_nodemcu.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
test_nodemcu.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
test_nodemcu.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
test_nodemcu.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
test_nodemcu.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
test_nodemcu.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
test_nodemcu.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
test_nodemcu.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
test_nodemcu.menu.mmu.ext128k=128K Heap External 23LC1024
test_nodemcu.menu.mmu.ext128k.build.mmuflags=-DMMU_EXTERNAL_HEAP=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
test_nodemcu.menu.mmu.ext8192k=8M w/256K Heap External 64 MBit PSRAM
test_nodemcu.menu.mmu.ext8192k.build.mmuflags=-DMMU_EXTERNAL_HEAP=256 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
test_nodemcu.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
test_nodemcu.menu.non32xfer.fast.build.non32xferflags=
test_nodemcu.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
test_nodemcu.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
test_nodemcu.menu.ResetMethod.nodemcu=dtr (aka nodemcu)
test_nodemcu.menu.ResetMethod.nodemcu.upload.resetmethod=--before default_reset --after hard_reset
test_nodemcu.menu.ResetMethod.ck=no dtr (aka ck)
test_nodemcu.menu.ResetMethod.ck.upload.resetmethod=--before no_reset --after soft_reset
test_nodemcu.menu.ResetMethod.nodtr_nosync=no dtr, no_sync
test_nodemcu.menu.ResetMethod.nodtr_nosync.upload.resetmethod=--before no_reset_no_sync --after soft_reset
test_nodemcu.menu.CrystalFreq.26=26 MHz
test_nodemcu.menu.CrystalFreq.40=40 MHz
test_nodemcu.menu.CrystalFreq.40.build.extra_flags=-DF_CRYSTAL=40000000
test_nodemcu.menu.FlashFreq.40=40MHz
test_nodemcu.menu.FlashFreq.40.build.flash_freq=40
test_nodemcu.menu.FlashFreq.80=80MHz
test_nodemcu.menu.FlashFreq.80.build.flash_freq=80
test_nodemcu.menu.FlashFreq.20=20MHz
test_nodemcu.menu.FlashFreq.20.build.flash_freq=20
test_nodemcu.menu.FlashFreq.26=26MHz
test_nodemcu.menu.FlashFreq.26.build.flash_freq=26
test_nodemcu.menu.FlashMode.dout=DOUT (compatible)
test_nodemcu.menu.FlashMode.dout.build.flash_mode=dout
test_nodemcu.menu.FlashMode.dout.build.flash_flags=-DFLASHMODE_DOUT
test_nodemcu.menu.FlashMode.dio=DIO
test_nodemcu.menu.FlashMode.dio.build.flash_mode=dio
test_nodemcu.menu.FlashMode.dio.build.flash_flags=-DFLASHMODE_DIO
test_nodemcu.menu.FlashMode.qout=QOUT
test_nodemcu.menu.FlashMode.qout.build.flash_mode=qout
test_nodemcu.menu.FlashMode.qout.build.flash_flags=-DFLASHMODE_QOUT
test_nodemcu.menu.FlashMode.qio=QIO (fast)
test_nodemcu.menu.FlashMode.qio.build.flash_mode=qio
test_nodemcu.menu.FlashMode.qio.build.flash_flags=-DFLASHMODE_QIO
test_nodemcu.menu.eesz.1M64=1MB (FS:64KB OTA:~470KB)
test_nodemcu.menu.eesz.1M64.build.flash_size=1M
test_nodemcu.menu.eesz.1M64.build.flash_ld=eagle.flash.1m64.ld
test_nodemcu.menu.eesz.1M64.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.1M64.build.rfcal_addr=0xFC000
test_nodemcu.menu.eesz.1M64.build.spiffs_start=0xEB000
test_nodemcu.menu.eesz.1M64.build.spiffs_end=0xFB000
test_nodemcu.menu.eesz.1M64.build.spiffs_blocksize=4096
test_nodemcu.menu.eesz.1M128=1MB (FS:128KB OTA:~438KB)
test_nodemcu.menu.eesz.1M128.build.flash_size=1M
test_nodemcu.menu.eesz.1M128.build.flash_ld=eagle.flash.1m128.ld
test_nodemcu.menu.eesz.1M128.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.1M128.build.rfcal_addr=0xFC000
test_nodemcu.menu.eesz.1M128.build.spiffs_start=0xDB000
test_nodemcu.menu.eesz.1M128.build.spiffs_end=0xFB000
test_nodemcu.menu.eesz.1M128.build.spiffs_blocksize=4096
test_nodemcu.menu.eesz.1M144=1MB (FS:144KB OTA:~430KB)
test_nodemcu.menu.eesz.1M144.build.flash_size=1M
test_nodemcu.menu.eesz.1M144.build.flash_ld=eagle.flash.1m144.ld
test_nodemcu.menu.eesz.1M144.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.1M144.build.rfcal_addr=0xFC000
test_nodemcu.menu.eesz.1M144.build.spiffs_start=0xD7000
test_nodemcu.menu.eesz.1M144.build.spiffs_end=0xFB000
test_nodemcu.menu.eesz.1M144.build.spiffs_blocksize=4096
test_nodemcu.menu.eesz.1M160=1MB (FS:160KB OTA:~422KB)
test_nodemcu.menu.eesz.1M160.build.flash_size=1M
test_nodemcu.menu.eesz.1M160.build.flash_ld=eagle.flash.1m160.ld
test_nodemcu.menu.eesz.1M160.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.1M160.build.rfcal_addr=0xFC000
test_nodemcu.menu.eesz.1M160.build.spiffs_start=0xD3000
test_nodemcu.menu.eesz.1M160.build.spiffs_end=0xFB000
test_nodemcu.menu.eesz.1M160.build.spiffs_blocksize=4096
test_nodemcu.menu.eesz.1M192=1MB (FS:192KB OTA:~406KB)
test_nodemcu.menu.eesz.1M192.build.flash_size=1M
test_nodemcu.menu.eesz.1M192.build.flash_ld=eagle.flash.1m192.ld
test_nodemcu.menu.eesz.1M192.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.1M192.build.rfcal_addr=0xFC000
test_nodemcu.menu.eesz.1M192.build.spiffs_start=0xCB000
test_nodemcu.menu.eesz.1M192.build.spiffs_end=0xFB000
test_nodemcu.menu.eesz.1M192.build.spiffs_blocksize=4096
test_nodemcu.menu.eesz.1M256=1MB (FS:256KB OTA:~374KB)
test_nodemcu.menu.eesz.1M256.build.flash_size=1M
test_nodemcu.menu.eesz.1M256.build.flash_ld=eagle.flash.1m256.ld
test_nodemcu.menu.eesz.1M256.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.1M256.build.rfcal_addr=0xFC000
test_nodemcu.menu.eesz.1M256.build.spiffs_start=0xBB000
test_nodemcu.menu.eesz.1M256.build.spiffs_end=0xFB000
test_nodemcu.menu.eesz.1M256.build.spiffs_blocksize=4096
test_nodemcu.menu.eesz.1M512=1MB (FS:512KB OTA:~246KB)
test_nodemcu.menu.eesz.1M512.build.flash_size=1M
test_nodemcu.menu.eesz.1M512.build.flash_ld=eagle.flash.1m512.ld
test_nodemcu.menu.eesz.1M512.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.1M512.build.rfcal_addr=0xFC000
test_nodemcu.menu.eesz.1M512.build.spiffs_start=0x7B000
test_nodemcu.menu.eesz.1M512.build.spiffs_end=0xFB000
test_nodemcu.menu.eesz.1M512.build.spiffs_blocksize=8192
test_nodemcu.menu.eesz.1M=1MB (FS:none OTA:~502KB)
test_nodemcu.menu.eesz.1M.build.flash_size=1M
test_nodemcu.menu.eesz.1M.build.flash_ld=eagle.flash.1m.ld
test_nodemcu.menu.eesz.1M.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.1M.build.rfcal_addr=0xFC000
test_nodemcu.menu.eesz.2M64=2MB (FS:64KB OTA:~992KB)
test_nodemcu.menu.eesz.2M64.build.flash_size=2M
test_nodemcu.menu.eesz.2M64.build.flash_ld=eagle.flash.2m64.ld
test_nodemcu.menu.eesz.2M64.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.2M64.build.rfcal_addr=0x1FC000
test_nodemcu.menu.eesz.2M64.build.spiffs_start=0x1F0000
test_nodemcu.menu.eesz.2M64.build.spiffs_end=0x1FB000
test_nodemcu.menu.eesz.2M64.build.spiffs_blocksize=4096
test_nodemcu.menu.eesz.2M128=2MB (FS:128KB OTA:~960KB)
test_nodemcu.menu.eesz.2M128.build.flash_size=2M
test_nodemcu.menu.eesz.2M128.build.flash_ld=eagle.flash.2m128.ld
test_nodemcu.menu.eesz.2M128.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.2M128.build.rfcal_addr=0x1FC000
test_nodemcu.menu.eesz.2M128.build.spiffs_start=0x1E0000
test_nodemcu.menu.eesz.2M128.build.spiffs_end=0x1FB000
test_nodemcu.menu.eesz.2M128.build.spiffs_blocksize=4096
test_nodemcu.menu.eesz.2M256=2MB (FS:256KB OTA:~896KB)
test_nodemcu.menu.eesz.2M256.build.flash_size=2M
test_nodemcu.menu.eesz.2M256.build.flash_ld=eagle.flash.2m256.ld
test_nodemcu.menu.eesz.2M256.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.2M256.build.rfcal_addr=0x1FC000
test_nodemcu.menu.eesz.2M256.build.spiffs_start=0x1C0000
test_nodemcu.menu.eesz.2M256.build.spiffs_end=0x1FB000
test_nodemcu.menu.eesz.2M256.build.spiffs_blocksize=4096
test_nodemcu.menu.eesz.2M512=2MB (FS:512KB OTA:~768KB)
test_nodemcu.menu.eesz.2M512.build.flash_size=2M
test_nodemcu.menu.eesz.2M512.build.flash_ld=eagle.flash.2m512.ld
test_nodemcu.menu.eesz.2M512.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.2M512.build.rfcal_addr=0x1FC000
test_nodemcu.menu.eesz.2M512.build.spiffs_start=0x180000
test_nodemcu.menu.eesz.2M512.build.spiffs_end=0x1FA000
test_nodemcu.menu.eesz.2M512.build.spiffs_blocksize=8192
test_nodemcu.menu.eesz.2M1M=2MB (FS:1MB OTA:~512KB)
test_nodemcu.menu.eesz.2M1M.build.flash_size=2M
test_nodemcu.menu.eesz.2M1M.build.flash_ld=eagle.flash.2m1m.ld
test_nodemcu.menu.eesz.2M1M.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.2M1M.build.rfcal_addr=0x1FC000
test_nodemcu.menu.eesz.2M1M.build.spiffs_start=0x100000
test_nodemcu.menu.eesz.2M1M.build.spiffs_end=0x1FA000
test_nodemcu.menu.eesz.2M1M.build.spiffs_blocksize=8192
test_nodemcu.menu.eesz.2M=2MB (FS:none OTA:~1019KB)
test_nodemcu.menu.eesz.2M.build.flash_size=2M
test_nodemcu.menu.eesz.2M.build.flash_ld=eagle.flash.2m.ld
test_nodemcu.menu.eesz.2M.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.2M.build.rfcal_addr=0x1FC000
test_nodemcu.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
test_nodemcu.menu.eesz.4M2M.build.flash_size=4M
test_nodemcu.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
test_nodemcu.menu.eesz.4M2M.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
test_nodemcu.menu.eesz.4M2M.build.spiffs_start=0x200000
test_nodemcu.menu.eesz.4M2M.build.spiffs_end=0x3FA000
test_nodemcu.menu.eesz.4M2M.build.spiffs_blocksize=8192
test_nodemcu.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
test_nodemcu.menu.eesz.4M3M.build.flash_size=4M
test_nodemcu.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
test_nodemcu.menu.eesz.4M3M.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
test_nodemcu.menu.eesz.4M3M.build.spiffs_start=0x100000
test_nodemcu.menu.eesz.4M3M.build.spiffs_end=0x3FA000
test_nodemcu.menu.eesz.4M3M.build.spiffs_blocksize=8192
test_nodemcu.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
test_nodemcu.menu.eesz.4M1M.build.flash_size=4M
test_nodemcu.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
test_nodemcu.menu.eesz.4M1M.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
test_nodemcu.menu.eesz.4M1M.build.spiffs_start=0x300000
test_nodemcu.menu.eesz.4M1M.build.spiffs_end=0x3FA000
test_nodemcu.menu.eesz.4M1M.build.spiffs_blocksize=8192
test_nodemcu.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
test_nodemcu.menu.eesz.4M.build.flash_size=4M
test_nodemcu.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
test_nodemcu.menu.eesz.4M.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.4M.build.rfcal_addr=0x3FC000
test_nodemcu.menu.eesz.8M6M=8MB (FS:6MB OTA:~1019KB)
test_nodemcu.menu.eesz.8M6M.build.flash_size=8M
test_nodemcu.menu.eesz.8M6M.build.flash_ld=eagle.flash.8m6m.ld
test_nodemcu.menu.eesz.8M6M.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.8M6M.build.rfcal_addr=0x7FC000
test_nodemcu.menu.eesz.8M6M.build.spiffs_start=0x200000
test_nodemcu.menu.eesz.8M6M.build.spiffs_end=0x7FA000
test_nodemcu.menu.eesz.8M6M.build.spiffs_blocksize=8192
test_nodemcu.menu.eesz.8M7M=8MB (FS:7MB OTA:~512KB)
test_nodemcu.menu.eesz.8M7M.build.flash_size=8M
test_nodemcu.menu.eesz.8M7M.build.flash_ld=eagle.flash.8m7m.ld
test_nodemcu.menu.eesz.8M7M.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.8M7M.build.rfcal_addr=0x7FC000
test_nodemcu.menu.eesz.8M7M.build.spiffs_start=0x100000
test_nodemcu.menu.eesz.8M7M.build.spiffs_end=0x7FA000
test_nodemcu.menu.eesz.8M7M.build.spiffs_blocksize=8192
test_nodemcu.menu.eesz.8M=8MB (FS:none OTA:~1019KB)
test_nodemcu.menu.eesz.8M.build.flash_size=8M
test_nodemcu.menu.eesz.8M.build.flash_ld=eagle.flash.8m.ld
test_nodemcu.menu.eesz.8M.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.8M.build.rfcal_addr=0x7FC000
test_nodemcu.menu.eesz.16M14M=16MB (FS:14MB OTA:~1019KB)
test_nodemcu.menu.eesz.16M14M.build.flash_size=16M
test_nodemcu.menu.eesz.16M14M.build.flash_ld=eagle.flash.16m14m.ld
test_nodemcu.menu.eesz.16M14M.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.16M14M.build.rfcal_addr=0xFFC000
test_nodemcu.menu.eesz.16M14M.build.spiffs_start=0x200000
test_nodemcu.menu.eesz.16M14M.build.spiffs_end=0xFFA000
test_nodemcu.menu.eesz.16M14M.build.spiffs_blocksize=8192
test_nodemcu.menu.eesz.16M15M=16MB (FS:15MB OTA:~512KB)
test_nodemcu.menu.eesz.16M15M.build.flash_size=16M
test_nodemcu.menu.eesz.16M15M.build.flash_ld=eagle.flash.16m15m.ld
test_nodemcu.menu.eesz.16M15M.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.16M15M.build.rfcal_addr=0xFFC000
test_nodemcu.menu.eesz.16M15M.build.spiffs_start=0x100000
test_nodemcu.menu.eesz.16M15M.build.spiffs_end=0xFFA000
test_nodemcu.menu.eesz.16M15M.build.spiffs_blocksize=8192
test_nodemcu.menu.eesz.16M=16MB (FS:none OTA:~1019KB)
test_nodemcu.menu.eesz.16M.build.flash_size=16M
test_nodemcu.menu.eesz.16M.build.flash_ld=eagle.flash.16m.ld
test_nodemcu.menu.eesz.16M.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.16M.build.rfcal_addr=0xFFC000
test_nodemcu.menu.eesz.512K32=512KB (FS:32KB OTA:~230KB)
test_nodemcu.menu.eesz.512K32.build.flash_size=512K
test_nodemcu.menu.eesz.512K32.build.flash_ld=eagle.flash.512k32.ld
test_nodemcu.menu.eesz.512K32.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.512K32.build.rfcal_addr=0x7C000
test_nodemcu.menu.eesz.512K32.build.spiffs_start=0x73000
test_nodemcu.menu.eesz.512K32.build.spiffs_end=0x7B000
test_nodemcu.menu.eesz.512K32.build.spiffs_blocksize=4096
test_nodemcu.menu.eesz.512K64=512KB (FS:64KB OTA:~214KB)
test_nodemcu.menu.eesz.512K64.build.flash_size=512K
test_nodemcu.menu.eesz.512K64.build.flash_ld=eagle.flash.512k64.ld
test_nodemcu.menu.eesz.512K64.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.512K64.build.rfcal_addr=0x7C000
test_nodemcu.menu.eesz.512K64.build.spiffs_start=0x6B000
test_nodemcu.menu.eesz.512K64.build.spiffs_end=0x7B000
test_nodemcu.menu.eesz.512K64.build.spiffs_blocksize=4096
test_nodemcu.menu.eesz.512K128=512KB (FS:128KB OTA:~182KB)
test_nodemcu.menu.eesz.512K128.build.flash_size=512K
test_nodemcu.menu.eesz.512K128.build.flash_ld=eagle.flash.512k128.ld
test_nodemcu.menu.eesz.512K128.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.512K128.build.rfcal_addr=0x7C000
test_nodemcu.menu.eesz.512K128.build.spiffs_start=0x5B000
test_nodemcu.menu.eesz.512K128.build.spiffs_end=0x7B000
test_nodemcu.menu.eesz.512K128.build.spiffs_blocksize=4096
test_nodemcu.menu.eesz.512K=512KB (FS:none OTA:~246KB)
test_nodemcu.menu.eesz.512K.build.flash_size=512K
test_nodemcu.menu.eesz.512K.build.flash_ld=eagle.flash.512k.ld
test_nodemcu.menu.eesz.512K.build.spiffs_pagesize=256
test_nodemcu.menu.eesz.512K.build.rfcal_addr=0x7C000
test_nodemcu.menu.sdk.nonosdk_190703=nonos-sdk 2.2.1+100 (190703)
test_nodemcu.menu.sdk.nonosdk_190703.build.sdk=NONOSDK22x_190703
test_nodemcu.menu.sdk.nonosdk_191122=nonos-sdk 2.2.1+119 (191122)
test_nodemcu.menu.sdk.nonosdk_191122.build.sdk=NONOSDK22x_191122
test_nodemcu.menu.sdk.nonosdk_191105=nonos-sdk 2.2.1+113 (191105)
test_nodemcu.menu.sdk.nonosdk_191105.build.sdk=NONOSDK22x_191105
test_nodemcu.menu.sdk.nonosdk_191024=nonos-sdk 2.2.1+111 (191024)
test_nodemcu.menu.sdk.nonosdk_191024.build.sdk=NONOSDK22x_191024
test_nodemcu.menu.sdk.nonosdk_190313=nonos-sdk 2.2.1+61 (190313)
test_nodemcu.menu.sdk.nonosdk_190313.build.sdk=NONOSDK22x_190313
test_nodemcu.menu.sdk.nonosdk221=nonos-sdk 2.2.1 (legacy)
test_nodemcu.menu.sdk.nonosdk221.build.sdk=NONOSDK221
test_nodemcu.menu.sdk.nonosdk305=nonos-sdk 3.0.5 (experimental)
test_nodemcu.menu.sdk.nonosdk305.build.sdk=NONOSDK305
test_nodemcu.menu.ip.lm2f=v2 Lower Memory
test_nodemcu.menu.ip.lm2f.build.lwip_include=lwip2/include
test_nodemcu.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
test_nodemcu.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
test_nodemcu.menu.ip.hb2f=v2 Higher Bandwidth
test_nodemcu.menu.ip.hb2f.build.lwip_include=lwip2/include
test_nodemcu.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
test_nodemcu.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
test_nodemcu.menu.ip.lm2n=v2 Lower Memory (no features)
test_nodemcu.menu.ip.lm2n.build.lwip_include=lwip2/include
test_nodemcu.menu.ip.lm2n.build.lwip_lib=-llwip2-536
test_nodemcu.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
test_nodemcu.menu.ip.hb2n=v2 Higher Bandwidth (no features)
