fabiangv29/Esp8266/boards.txt
test_nodemcu.menu.ip.hb2n.build.lwip_include=lwip2/include
test_nodemcu.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
test_nodemcu.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
test_nodemcu.menu.ip.lm6f=v2 IPv6 Lower Memory
test_nodemcu.menu.ip.lm6f.build.lwip_include=lwip2/include
test_nodemcu.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
test_nodemcu.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
test_nodemcu.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
test_nodemcu.menu.ip.hb6f.build.lwip_include=lwip2/include
test_nodemcu.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
test_nodemcu.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
test_nodemcu.menu.dbg.Disabled=Disabled
test_nodemcu.menu.dbg.Disabled.build.debug_port=
test_nodemcu.menu.dbg.Serial=Serial
test_nodemcu.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
test_nodemcu.menu.dbg.Serial1=Serial1
test_nodemcu.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
test_nodemcu.menu.lvl.None____=None
test_nodemcu.menu.lvl.None____.build.debug_level=
test_nodemcu.menu.lvl.SSL=SSL
test_nodemcu.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
test_nodemcu.menu.lvl.TLS_MEM=TLS_MEM
test_nodemcu.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
test_nodemcu.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
test_nodemcu.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
test_nodemcu.menu.lvl.HTTP_SERVER=HTTP_SERVER
test_nodemcu.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
test_nodemcu.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
test_nodemcu.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
test_nodemcu.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
test_nodemcu.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
test_nodemcu.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
test_nodemcu.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
test_nodemcu.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
test_nodemcu.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
test_nodemcu.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
test_nodemcu.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
test_nodemcu.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
test_nodemcu.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
test_nodemcu.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
test_nodemcu.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
test_nodemcu.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
test_nodemcu.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
test_nodemcu.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
test_nodemcu.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
test_nodemcu.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
test_nodemcu.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
test_nodemcu.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
test_nodemcu.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
test_nodemcu.menu.lvl.CORE=CORE
test_nodemcu.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
test_nodemcu.menu.lvl.WIFI=WIFI
test_nodemcu.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
test_nodemcu.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
test_nodemcu.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
test_nodemcu.menu.lvl.UPDATER=UPDATER
test_nodemcu.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
test_nodemcu.menu.lvl.OTA=OTA
test_nodemcu.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
test_nodemcu.menu.lvl.OOM=OOM
test_nodemcu.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
test_nodemcu.menu.lvl.MDNS=MDNS
test_nodemcu.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
test_nodemcu.menu.lvl.HWDT=HWDT
test_nodemcu.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
test_nodemcu.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
test_nodemcu.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
test_nodemcu.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
test_nodemcu.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
test_nodemcu.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
test_nodemcu.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
test_nodemcu.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
test_nodemcu.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
test_nodemcu.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
test_nodemcu.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
test_nodemcu.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
test_nodemcu.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
test_nodemcu.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
test_nodemcu.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
test_nodemcu.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
test_nodemcu.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
test_nodemcu.menu.wipe.none=Only Sketch
test_nodemcu.menu.wipe.none.upload.erase_cmd=
test_nodemcu.menu.wipe.sdk=Sketch + WiFi Settings
test_nodemcu.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
test_nodemcu.menu.wipe.all=All Flash Contents
test_nodemcu.menu.wipe.all.upload.erase_cmd=erase_flash
test_nodemcu.menu.baud.115200=115200
test_nodemcu.menu.baud.115200.upload.speed=115200
test_nodemcu.menu.baud.57600=57600
test_nodemcu.menu.baud.57600.upload.speed=57600
test_nodemcu.menu.baud.230400.linux=230400
test_nodemcu.menu.baud.230400.macosx=230400
test_nodemcu.menu.baud.230400.upload.speed=230400
test_nodemcu.menu.baud.256000.windows=256000
test_nodemcu.menu.baud.256000.upload.speed=256000
test_nodemcu.menu.baud.460800.linux=460800
test_nodemcu.menu.baud.460800.macosx=460800
test_nodemcu.menu.baud.460800.upload.speed=460800
test_nodemcu.menu.baud.512000.windows=512000
test_nodemcu.menu.baud.512000.upload.speed=512000
test_nodemcu.menu.baud.921600=921600
test_nodemcu.menu.baud.921600.upload.speed=921600
test_nodemcu.menu.baud.3000000=3000000
test_nodemcu.menu.baud.3000000.upload.speed=3000000
test_nodemcu.menu.eesz.autoflash=Mapping defined by Hardware and Sketch
test_nodemcu.menu.eesz.autoflash.build.flash_size=16M
test_nodemcu.menu.eesz.autoflash.build.flash_ld=eagle.flash.auto.ld
test_nodemcu.menu.eesz.autoflash.build.extra_flags=-DFLASH_MAP_SUPPORT=1
test_nodemcu.menu.eesz.autoflash.upload.maximum_size=1044464


