fabiangv29/Esp8266/boards.txt
##############################################################
sonoff_t1_3.name=Sonoff T1 3
sonoff_t1_3.build.board=Sonoff_T1_3
sonoff_t1_3.build.variant=sonoff_t1_3
sonoff_t1_3.upload.tool=esptool
sonoff_t1_3.upload.maximum_data_size=81920
sonoff_t1_3.upload.wait_for_upload_port=true
sonoff_t1_3.upload.erase_cmd=
sonoff_t1_3.serial.disableDTR=true
sonoff_t1_3.serial.disableRTS=true
sonoff_t1_3.build.mcu=esp8266
sonoff_t1_3.build.core=esp8266
sonoff_t1_3.build.spiffs_pagesize=256
sonoff_t1_3.build.debug_port=
sonoff_t1_3.build.debug_level=
sonoff_t1_3.menu.xtal.80=80 MHz
sonoff_t1_3.menu.xtal.80.build.f_cpu=80000000L
sonoff_t1_3.menu.xtal.160=160 MHz
sonoff_t1_3.menu.xtal.160.build.f_cpu=160000000L
sonoff_t1_3.menu.vt.flash=Flash
sonoff_t1_3.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
sonoff_t1_3.menu.vt.heap=Heap
sonoff_t1_3.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
sonoff_t1_3.menu.vt.iram=IRAM
sonoff_t1_3.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
sonoff_t1_3.menu.exception.disabled=Disabled (new aborts on oom)
sonoff_t1_3.menu.exception.disabled.build.exception_flags=-fno-exceptions
sonoff_t1_3.menu.exception.disabled.build.stdcpp_lib=-lstdc++
sonoff_t1_3.menu.exception.enabled=Enabled
sonoff_t1_3.menu.exception.enabled.build.exception_flags=-fexceptions
sonoff_t1_3.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
sonoff_t1_3.menu.stacksmash.disabled=Disabled
sonoff_t1_3.menu.stacksmash.disabled.build.stacksmash_flags=
sonoff_t1_3.menu.stacksmash.enabled=Enabled
sonoff_t1_3.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
sonoff_t1_3.menu.ssl.all=All SSL ciphers (most compatible)
sonoff_t1_3.menu.ssl.all.build.sslflags=
sonoff_t1_3.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
sonoff_t1_3.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
sonoff_t1_3.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
sonoff_t1_3.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
sonoff_t1_3.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
sonoff_t1_3.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
sonoff_t1_3.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
sonoff_t1_3.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
sonoff_t1_3.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
sonoff_t1_3.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
sonoff_t1_3.menu.mmu.ext128k=128K Heap External 23LC1024
sonoff_t1_3.menu.mmu.ext128k.build.mmuflags=-DMMU_EXTERNAL_HEAP=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
sonoff_t1_3.menu.mmu.ext8192k=8M w/256K Heap External 64 MBit PSRAM
sonoff_t1_3.menu.mmu.ext8192k.build.mmuflags=-DMMU_EXTERNAL_HEAP=256 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
sonoff_t1_3.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
sonoff_t1_3.menu.non32xfer.fast.build.non32xferflags=
sonoff_t1_3.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
sonoff_t1_3.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
sonoff_t1_3.menu.ResetMethod.nodemcu=dtr (aka nodemcu)
sonoff_t1_3.menu.ResetMethod.nodemcu.upload.resetmethod=--before default_reset --after hard_reset
sonoff_t1_3.menu.ResetMethod.ck=no dtr (aka ck)
sonoff_t1_3.menu.ResetMethod.ck.upload.resetmethod=--before no_reset --after soft_reset
sonoff_t1_3.menu.ResetMethod.nodtr_nosync=no dtr, no_sync
sonoff_t1_3.menu.ResetMethod.nodtr_nosync.upload.resetmethod=--before no_reset_no_sync --after soft_reset
sonoff_t1_3.menu.CrystalFreq.26=26 MHz
sonoff_t1_3.menu.CrystalFreq.40=40 MHz
sonoff_t1_3.menu.CrystalFreq.40.build.extra_flags=-DF_CRYSTAL=40000000
sonoff_t1_3.menu.FlashFreq.40=40MHz
sonoff_t1_3.menu.FlashFreq.40.build.flash_freq=40
sonoff_t1_3.menu.FlashFreq.80=80MHz
sonoff_t1_3.menu.FlashFreq.80.build.flash_freq=80
sonoff_t1_3.menu.FlashFreq.20=20MHz
sonoff_t1_3.menu.FlashFreq.20.build.flash_freq=20
sonoff_t1_3.menu.FlashFreq.26=26MHz
sonoff_t1_3.menu.FlashFreq.26.build.flash_freq=26
sonoff_t1_3.menu.FlashMode.dout=DOUT (compatible)
sonoff_t1_3.menu.FlashMode.dout.build.flash_mode=dout
sonoff_t1_3.menu.FlashMode.dout.build.flash_flags=-DFLASHMODE_DOUT
sonoff_t1_3.menu.FlashMode.dio=DIO
sonoff_t1_3.menu.FlashMode.dio.build.flash_mode=dio
sonoff_t1_3.menu.FlashMode.dio.build.flash_flags=-DFLASHMODE_DIO
sonoff_t1_3.menu.FlashMode.qout=QOUT
sonoff_t1_3.menu.FlashMode.qout.build.flash_mode=qout
sonoff_t1_3.menu.FlashMode.qout.build.flash_flags=-DFLASHMODE_QOUT
sonoff_t1_3.menu.FlashMode.qio=QIO (fast)
sonoff_t1_3.menu.FlashMode.qio.build.flash_mode=qio
sonoff_t1_3.menu.FlashMode.qio.build.flash_flags=-DFLASHMODE_QIO
sonoff_t1_3.menu.eesz.1M64=1MB (FS:64KB OTA:~470KB)
sonoff_t1_3.menu.eesz.1M64.build.flash_size=1M
sonoff_t1_3.menu.eesz.1M64.build.flash_ld=eagle.flash.1m64.ld
sonoff_t1_3.menu.eesz.1M64.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.1M64.build.rfcal_addr=0xFC000
sonoff_t1_3.menu.eesz.1M64.build.spiffs_start=0xEB000
sonoff_t1_3.menu.eesz.1M64.build.spiffs_end=0xFB000
sonoff_t1_3.menu.eesz.1M64.build.spiffs_blocksize=4096
sonoff_t1_3.menu.eesz.1M128=1MB (FS:128KB OTA:~438KB)
sonoff_t1_3.menu.eesz.1M128.build.flash_size=1M
sonoff_t1_3.menu.eesz.1M128.build.flash_ld=eagle.flash.1m128.ld
sonoff_t1_3.menu.eesz.1M128.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.1M128.build.rfcal_addr=0xFC000
sonoff_t1_3.menu.eesz.1M128.build.spiffs_start=0xDB000
sonoff_t1_3.menu.eesz.1M128.build.spiffs_end=0xFB000
sonoff_t1_3.menu.eesz.1M128.build.spiffs_blocksize=4096
sonoff_t1_3.menu.eesz.1M144=1MB (FS:144KB OTA:~430KB)
sonoff_t1_3.menu.eesz.1M144.build.flash_size=1M
sonoff_t1_3.menu.eesz.1M144.build.flash_ld=eagle.flash.1m144.ld
sonoff_t1_3.menu.eesz.1M144.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.1M144.build.rfcal_addr=0xFC000
sonoff_t1_3.menu.eesz.1M144.build.spiffs_start=0xD7000
sonoff_t1_3.menu.eesz.1M144.build.spiffs_end=0xFB000
sonoff_t1_3.menu.eesz.1M144.build.spiffs_blocksize=4096
sonoff_t1_3.menu.eesz.1M160=1MB (FS:160KB OTA:~422KB)
sonoff_t1_3.menu.eesz.1M160.build.flash_size=1M
sonoff_t1_3.menu.eesz.1M160.build.flash_ld=eagle.flash.1m160.ld
sonoff_t1_3.menu.eesz.1M160.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.1M160.build.rfcal_addr=0xFC000
sonoff_t1_3.menu.eesz.1M160.build.spiffs_start=0xD3000
sonoff_t1_3.menu.eesz.1M160.build.spiffs_end=0xFB000
sonoff_t1_3.menu.eesz.1M160.build.spiffs_blocksize=4096
sonoff_t1_3.menu.eesz.1M192=1MB (FS:192KB OTA:~406KB)
sonoff_t1_3.menu.eesz.1M192.build.flash_size=1M
sonoff_t1_3.menu.eesz.1M192.build.flash_ld=eagle.flash.1m192.ld
sonoff_t1_3.menu.eesz.1M192.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.1M192.build.rfcal_addr=0xFC000
sonoff_t1_3.menu.eesz.1M192.build.spiffs_start=0xCB000
sonoff_t1_3.menu.eesz.1M192.build.spiffs_end=0xFB000
sonoff_t1_3.menu.eesz.1M192.build.spiffs_blocksize=4096
sonoff_t1_3.menu.eesz.1M256=1MB (FS:256KB OTA:~374KB)
sonoff_t1_3.menu.eesz.1M256.build.flash_size=1M
sonoff_t1_3.menu.eesz.1M256.build.flash_ld=eagle.flash.1m256.ld
sonoff_t1_3.menu.eesz.1M256.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.1M256.build.rfcal_addr=0xFC000
sonoff_t1_3.menu.eesz.1M256.build.spiffs_start=0xBB000
sonoff_t1_3.menu.eesz.1M256.build.spiffs_end=0xFB000
sonoff_t1_3.menu.eesz.1M256.build.spiffs_blocksize=4096
sonoff_t1_3.menu.eesz.1M512=1MB (FS:512KB OTA:~246KB)
sonoff_t1_3.menu.eesz.1M512.build.flash_size=1M
sonoff_t1_3.menu.eesz.1M512.build.flash_ld=eagle.flash.1m512.ld
sonoff_t1_3.menu.eesz.1M512.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.1M512.build.rfcal_addr=0xFC000
sonoff_t1_3.menu.eesz.1M512.build.spiffs_start=0x7B000
sonoff_t1_3.menu.eesz.1M512.build.spiffs_end=0xFB000
sonoff_t1_3.menu.eesz.1M512.build.spiffs_blocksize=8192
sonoff_t1_3.menu.eesz.1M=1MB (FS:none OTA:~502KB)
sonoff_t1_3.menu.eesz.1M.build.flash_size=1M
sonoff_t1_3.menu.eesz.1M.build.flash_ld=eagle.flash.1m.ld
sonoff_t1_3.menu.eesz.1M.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.1M.build.rfcal_addr=0xFC000
sonoff_t1_3.menu.eesz.2M64=2MB (FS:64KB OTA:~992KB)
sonoff_t1_3.menu.eesz.2M64.build.flash_size=2M
sonoff_t1_3.menu.eesz.2M64.build.flash_ld=eagle.flash.2m64.ld
sonoff_t1_3.menu.eesz.2M64.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.2M64.build.rfcal_addr=0x1FC000
sonoff_t1_3.menu.eesz.2M64.build.spiffs_start=0x1F0000
sonoff_t1_3.menu.eesz.2M64.build.spiffs_end=0x1FB000
sonoff_t1_3.menu.eesz.2M64.build.spiffs_blocksize=4096
sonoff_t1_3.menu.eesz.2M128=2MB (FS:128KB OTA:~960KB)
sonoff_t1_3.menu.eesz.2M128.build.flash_size=2M
sonoff_t1_3.menu.eesz.2M128.build.flash_ld=eagle.flash.2m128.ld
sonoff_t1_3.menu.eesz.2M128.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.2M128.build.rfcal_addr=0x1FC000
sonoff_t1_3.menu.eesz.2M128.build.spiffs_start=0x1E0000
sonoff_t1_3.menu.eesz.2M128.build.spiffs_end=0x1FB000
sonoff_t1_3.menu.eesz.2M128.build.spiffs_blocksize=4096
sonoff_t1_3.menu.eesz.2M256=2MB (FS:256KB OTA:~896KB)
sonoff_t1_3.menu.eesz.2M256.build.flash_size=2M
sonoff_t1_3.menu.eesz.2M256.build.flash_ld=eagle.flash.2m256.ld
sonoff_t1_3.menu.eesz.2M256.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.2M256.build.rfcal_addr=0x1FC000
sonoff_t1_3.menu.eesz.2M256.build.spiffs_start=0x1C0000
sonoff_t1_3.menu.eesz.2M256.build.spiffs_end=0x1FB000
sonoff_t1_3.menu.eesz.2M256.build.spiffs_blocksize=4096
sonoff_t1_3.menu.eesz.2M512=2MB (FS:512KB OTA:~768KB)
sonoff_t1_3.menu.eesz.2M512.build.flash_size=2M
sonoff_t1_3.menu.eesz.2M512.build.flash_ld=eagle.flash.2m512.ld
sonoff_t1_3.menu.eesz.2M512.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.2M512.build.rfcal_addr=0x1FC000
sonoff_t1_3.menu.eesz.2M512.build.spiffs_start=0x180000
sonoff_t1_3.menu.eesz.2M512.build.spiffs_end=0x1FA000
sonoff_t1_3.menu.eesz.2M512.build.spiffs_blocksize=8192
sonoff_t1_3.menu.eesz.2M1M=2MB (FS:1MB OTA:~512KB)
sonoff_t1_3.menu.eesz.2M1M.build.flash_size=2M
sonoff_t1_3.menu.eesz.2M1M.build.flash_ld=eagle.flash.2m1m.ld
sonoff_t1_3.menu.eesz.2M1M.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.2M1M.build.rfcal_addr=0x1FC000
sonoff_t1_3.menu.eesz.2M1M.build.spiffs_start=0x100000
sonoff_t1_3.menu.eesz.2M1M.build.spiffs_end=0x1FA000
sonoff_t1_3.menu.eesz.2M1M.build.spiffs_blocksize=8192
sonoff_t1_3.menu.eesz.2M=2MB (FS:none OTA:~1019KB)
sonoff_t1_3.menu.eesz.2M.build.flash_size=2M
sonoff_t1_3.menu.eesz.2M.build.flash_ld=eagle.flash.2m.ld
sonoff_t1_3.menu.eesz.2M.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.2M.build.rfcal_addr=0x1FC000
sonoff_t1_3.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
sonoff_t1_3.menu.eesz.4M2M.build.flash_size=4M
sonoff_t1_3.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
sonoff_t1_3.menu.eesz.4M2M.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
sonoff_t1_3.menu.eesz.4M2M.build.spiffs_start=0x200000
sonoff_t1_3.menu.eesz.4M2M.build.spiffs_end=0x3FA000
sonoff_t1_3.menu.eesz.4M2M.build.spiffs_blocksize=8192
sonoff_t1_3.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
sonoff_t1_3.menu.eesz.4M3M.build.flash_size=4M
sonoff_t1_3.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
sonoff_t1_3.menu.eesz.4M3M.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
sonoff_t1_3.menu.eesz.4M3M.build.spiffs_start=0x100000
sonoff_t1_3.menu.eesz.4M3M.build.spiffs_end=0x3FA000
sonoff_t1_3.menu.eesz.4M3M.build.spiffs_blocksize=8192
sonoff_t1_3.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
sonoff_t1_3.menu.eesz.4M1M.build.flash_size=4M
sonoff_t1_3.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
sonoff_t1_3.menu.eesz.4M1M.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
sonoff_t1_3.menu.eesz.4M1M.build.spiffs_start=0x300000
sonoff_t1_3.menu.eesz.4M1M.build.spiffs_end=0x3FA000
sonoff_t1_3.menu.eesz.4M1M.build.spiffs_blocksize=8192
sonoff_t1_3.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
sonoff_t1_3.menu.eesz.4M.build.flash_size=4M
sonoff_t1_3.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
sonoff_t1_3.menu.eesz.4M.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.4M.build.rfcal_addr=0x3FC000
sonoff_t1_3.menu.eesz.8M6M=8MB (FS:6MB OTA:~1019KB)
sonoff_t1_3.menu.eesz.8M6M.build.flash_size=8M
sonoff_t1_3.menu.eesz.8M6M.build.flash_ld=eagle.flash.8m6m.ld
sonoff_t1_3.menu.eesz.8M6M.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.8M6M.build.rfcal_addr=0x7FC000
sonoff_t1_3.menu.eesz.8M6M.build.spiffs_start=0x200000
sonoff_t1_3.menu.eesz.8M6M.build.spiffs_end=0x7FA000
sonoff_t1_3.menu.eesz.8M6M.build.spiffs_blocksize=8192
sonoff_t1_3.menu.eesz.8M7M=8MB (FS:7MB OTA:~512KB)
sonoff_t1_3.menu.eesz.8M7M.build.flash_size=8M
sonoff_t1_3.menu.eesz.8M7M.build.flash_ld=eagle.flash.8m7m.ld
sonoff_t1_3.menu.eesz.8M7M.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.8M7M.build.rfcal_addr=0x7FC000
sonoff_t1_3.menu.eesz.8M7M.build.spiffs_start=0x100000
sonoff_t1_3.menu.eesz.8M7M.build.spiffs_end=0x7FA000
sonoff_t1_3.menu.eesz.8M7M.build.spiffs_blocksize=8192
sonoff_t1_3.menu.eesz.8M=8MB (FS:none OTA:~1019KB)
sonoff_t1_3.menu.eesz.8M.build.flash_size=8M
sonoff_t1_3.menu.eesz.8M.build.flash_ld=eagle.flash.8m.ld
sonoff_t1_3.menu.eesz.8M.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.8M.build.rfcal_addr=0x7FC000
sonoff_t1_3.menu.eesz.16M14M=16MB (FS:14MB OTA:~1019KB)
sonoff_t1_3.menu.eesz.16M14M.build.flash_size=16M
sonoff_t1_3.menu.eesz.16M14M.build.flash_ld=eagle.flash.16m14m.ld
sonoff_t1_3.menu.eesz.16M14M.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.16M14M.build.rfcal_addr=0xFFC000
sonoff_t1_3.menu.eesz.16M14M.build.spiffs_start=0x200000
sonoff_t1_3.menu.eesz.16M14M.build.spiffs_end=0xFFA000
sonoff_t1_3.menu.eesz.16M14M.build.spiffs_blocksize=8192
sonoff_t1_3.menu.eesz.16M15M=16MB (FS:15MB OTA:~512KB)
sonoff_t1_3.menu.eesz.16M15M.build.flash_size=16M
sonoff_t1_3.menu.eesz.16M15M.build.flash_ld=eagle.flash.16m15m.ld
sonoff_t1_3.menu.eesz.16M15M.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.16M15M.build.rfcal_addr=0xFFC000
sonoff_t1_3.menu.eesz.16M15M.build.spiffs_start=0x100000
sonoff_t1_3.menu.eesz.16M15M.build.spiffs_end=0xFFA000
sonoff_t1_3.menu.eesz.16M15M.build.spiffs_blocksize=8192
sonoff_t1_3.menu.eesz.16M=16MB (FS:none OTA:~1019KB)
sonoff_t1_3.menu.eesz.16M.build.flash_size=16M
sonoff_t1_3.menu.eesz.16M.build.flash_ld=eagle.flash.16m.ld
sonoff_t1_3.menu.eesz.16M.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.16M.build.rfcal_addr=0xFFC000
sonoff_t1_3.menu.eesz.512K32=512KB (FS:32KB OTA:~230KB)
sonoff_t1_3.menu.eesz.512K32.build.flash_size=512K
sonoff_t1_3.menu.eesz.512K32.build.flash_ld=eagle.flash.512k32.ld
sonoff_t1_3.menu.eesz.512K32.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.512K32.build.rfcal_addr=0x7C000
sonoff_t1_3.menu.eesz.512K32.build.spiffs_start=0x73000
sonoff_t1_3.menu.eesz.512K32.build.spiffs_end=0x7B000
sonoff_t1_3.menu.eesz.512K32.build.spiffs_blocksize=4096
sonoff_t1_3.menu.eesz.512K64=512KB (FS:64KB OTA:~214KB)
sonoff_t1_3.menu.eesz.512K64.build.flash_size=512K
sonoff_t1_3.menu.eesz.512K64.build.flash_ld=eagle.flash.512k64.ld
sonoff_t1_3.menu.eesz.512K64.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.512K64.build.rfcal_addr=0x7C000
sonoff_t1_3.menu.eesz.512K64.build.spiffs_start=0x6B000
sonoff_t1_3.menu.eesz.512K64.build.spiffs_end=0x7B000
sonoff_t1_3.menu.eesz.512K64.build.spiffs_blocksize=4096
sonoff_t1_3.menu.eesz.512K128=512KB (FS:128KB OTA:~182KB)
sonoff_t1_3.menu.eesz.512K128.build.flash_size=512K
sonoff_t1_3.menu.eesz.512K128.build.flash_ld=eagle.flash.512k128.ld
sonoff_t1_3.menu.eesz.512K128.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.512K128.build.rfcal_addr=0x7C000
sonoff_t1_3.menu.eesz.512K128.build.spiffs_start=0x5B000
sonoff_t1_3.menu.eesz.512K128.build.spiffs_end=0x7B000
sonoff_t1_3.menu.eesz.512K128.build.spiffs_blocksize=4096
sonoff_t1_3.menu.eesz.512K=512KB (FS:none OTA:~246KB)
sonoff_t1_3.menu.eesz.512K.build.flash_size=512K
sonoff_t1_3.menu.eesz.512K.build.flash_ld=eagle.flash.512k.ld
sonoff_t1_3.menu.eesz.512K.build.spiffs_pagesize=256
sonoff_t1_3.menu.eesz.512K.build.rfcal_addr=0x7C000
sonoff_t1_3.menu.sdk.nonosdk_190703=nonos-sdk 2.2.1+100 (190703)
sonoff_t1_3.menu.sdk.nonosdk_190703.build.sdk=NONOSDK22x_190703
sonoff_t1_3.menu.sdk.nonosdk_191122=nonos-sdk 2.2.1+119 (191122)
sonoff_t1_3.menu.sdk.nonosdk_191122.build.sdk=NONOSDK22x_191122
sonoff_t1_3.menu.sdk.nonosdk_191105=nonos-sdk 2.2.1+113 (191105)
sonoff_t1_3.menu.sdk.nonosdk_191105.build.sdk=NONOSDK22x_191105
sonoff_t1_3.menu.sdk.nonosdk_191024=nonos-sdk 2.2.1+111 (191024)
sonoff_t1_3.menu.sdk.nonosdk_191024.build.sdk=NONOSDK22x_191024
sonoff_t1_3.menu.sdk.nonosdk_190313=nonos-sdk 2.2.1+61 (190313)
sonoff_t1_3.menu.sdk.nonosdk_190313.build.sdk=NONOSDK22x_190313
sonoff_t1_3.menu.sdk.nonosdk221=nonos-sdk 2.2.1 (legacy)
sonoff_t1_3.menu.sdk.nonosdk221.build.sdk=NONOSDK221
sonoff_t1_3.menu.sdk.nonosdk305=nonos-sdk 3.0.5 (experimental)
sonoff_t1_3.menu.sdk.nonosdk305.build.sdk=NONOSDK305
sonoff_t1_3.menu.ip.lm2f=v2 Lower Memory
sonoff_t1_3.menu.ip.lm2f.build.lwip_include=lwip2/include
sonoff_t1_3.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
sonoff_t1_3.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
sonoff_t1_3.menu.ip.hb2f=v2 Higher Bandwidth
sonoff_t1_3.menu.ip.hb2f.build.lwip_include=lwip2/include
sonoff_t1_3.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
sonoff_t1_3.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
sonoff_t1_3.menu.ip.lm2n=v2 Lower Memory (no features)
sonoff_t1_3.menu.ip.lm2n.build.lwip_include=lwip2/include
sonoff_t1_3.menu.ip.lm2n.build.lwip_lib=-llwip2-536
sonoff_t1_3.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
sonoff_t1_3.menu.ip.hb2n=v2 Higher Bandwidth (no features)
sonoff_t1_3.menu.ip.hb2n.build.lwip_include=lwip2/include
sonoff_t1_3.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
sonoff_t1_3.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
sonoff_t1_3.menu.ip.lm6f=v2 IPv6 Lower Memory
sonoff_t1_3.menu.ip.lm6f.build.lwip_include=lwip2/include
